examples/soap/zds1.1/Suites4SociaalDomein/dump/08-response-edcLv01 623 Lezen Document Zaak.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
   <s:Body>
      <edcLa01 xmlns="http://www.egem.nl/StUF/sector/zkn/0310" xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
         <stuurgegevens>
            <StUF:berichtcode>La01</StUF:berichtcode>
            <StUF:zender>
               <StUF:organisatie>1900</StUF:organisatie>
               <StUF:applicatie>CDR</StUF:applicatie>
            </StUF:zender>
            <StUF:ontvanger>
               <StUF:organisatie>1900</StUF:organisatie>
               <StUF:applicatie>GWS4all</StUF:applicatie>
               <StUF:gebruiker>Gebruiker</StUF:gebruiker>
            </StUF:ontvanger>
            <StUF:referentienummer>438039a6-3b23-47df-82f9-1921b7e27781</StUF:referentienummer>
            <StUF:tijdstipBericht>20200507075604097</StUF:tijdstipBericht>
            <StUF:crossRefnummer>b84e08ea-b406-4fcb-842d-6397e78da8b2</StUF:crossRefnummer>
            <StUF:entiteittype>EDC</StUF:entiteittype>
         </stuurgegevens>
         <parameters>
            <StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
         </parameters>
      </edcLa01>
   </s:Body>
</s:Envelope>